# 3-Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между 
# максимальным и минимальным значением дробной части элементов.
# Пример:
# [1.1, 1.2, 3.1, 5.17, 10.02] => 0.18 или 18
# [4.07, 5.1, 8.2444, 6.9814] - 0.9114 или 9114

def subtract_index(lst):
    lst2 = []
    for i in range (len(lst)):
        if i < len(lst): 
            a = lst[i] % 1  
            lst2.append(a)  
            i += 1 
            difference = max(lst2) - min(lst2)
    print(lst2)
    print("Разница дробных частей элементов равна: ", (round(difference, 4)))
  
lst = [3.14, 3.5678, 4.2, 9.425, 7.3003]
subtract_index(lst)



